{
    "version": "https://jsonfeed.org/version/1",
    "title": "Russellfix",
    "description": "",
    "home_page_url": "https://russellausterberry.github.io/russellfix",
    "feed_url": "https://russellausterberry.github.io/russellfix/feed.json",
    "user_comment": "",
    "icon": "https://russellausterberry.github.io/russellfix/media/website/Russellfix-logo-2.png",
    "author": {
        "name": "Russell Austerberry"
    },
    "items": [
        {
            "id": "https://russellausterberry.github.io/russellfix/computing-tips.html",
            "url": "https://russellausterberry.github.io/russellfix/computing-tips.html",
            "title": "computing tips",
            "summary": "From a lifetime wrangling computers, I've got some broad recommendations - some of them 'the road less travelled'. A smartphone is now a fully grown up member of the computer club, and with all it's sensors, cameras and apps can do a truly mind-boggling array&hellip;",
            "content_html": "<p>From a lifetime wrangling computers, I've got some broad recommendations - some of them 'the road less travelled'.</p>\n<h4>spend more on a smartphone than on a laptop</h4>\n<p>A smartphone is now a fully grown up member of the computer club, and with all it's sensors, cameras and apps can do a truly mind-boggling array of things. If you only get one device, get a smartphone - and pay as much as you can afford for something that will last 4 years or more.</p>\n<p>If need the larger screen size and productivity go for a laptop - but in this case my recommendation is to look for 2nd hand refurbished machines. Ex-government machines in particular are actually commerical grade gear rather than the flimsier retail-grade laptops you'll be tempted to buy new on a budget. In many cases refurbished machines are cheaper and actually better! </p>\n<h4>consider upgrading rather than buying new</h4>\n<p>If you have something up to about six years old that is annoyingly slow and you're thinking of getting a new machine... first check how far a little upgrading could go.</p>\n<ul>\n<li>Add RAM. RAM (memory) is like desktop space. If you have a big desktop, you can reach a lot of things quickly. If your desktop is too small, you need to turn and reach into the filing cabinet - which takes much more time. If your computer has too little RAM it stores 'desktop' stuff in the HDD (hard disk drive) which is just painfully slow. Up to a point, more RAM is a cheap simple way to speed up your computer.</li>\n<li>Put in an SSD (solid state drive). An SSD has no moving parts and is <em>very</em> quick compared to the old spinning disk type of drive. Of course you'll need to save files and re-install your operating system for this one...</li>\n<li>Upgrade your CPU (central processing unit). This should be the <em>last</em> thing you consider upgrading, as the first two measures will bring a lot of zip into even quite old computers. But if you want to squeeze more speed, it's a possiblity.</li>\n</ul>\n<h4>try Linux</h4>\n<p>I'm something of a Linux evangelist, and have now spent more time using Ubuntu (a version of LInux) than I have using Windows (and I started with Windows 95 on a set of floppy disks!).</p>\n<p>YES, for many it's something new and comes with a bit of a learning curve... however in my experience:</p>\n<ul>\n<li>Linux is free. (Actually you can also install  Windows 10 for free if you don't mind occasional nagging to register. <em>You don't have to!</em>)</li>\n<li>Installation is simple. In less than an hour I can do a clean install of Ubuntu, browse the web and have a word processor and spreadsheet as good as MS Office, all <em>FREE.</em> I find I need 3 or 4 hours to do likewise with Windows, with more reboots along the way.</li>\n<li>No marketing tentacles. You <em>can</em> sign up for an account but it's easy to fly completely under the radar.</li>\n<li>You probably don't need antivirus. There's debate on this, but Linux is very secure out of the box. </li>\n<li>Linux is more reliable. I reboot Ubuntu machine only once or twice a fortnight; with Windows that seems to happen much more often.</li>\n<li>Desktop experience is great. Nowadays you can go a long way on the desktop without having to dive into the command line, it's on a par with Windows in terms of ease of use.</li>\n<li>There's <em>heaps</em> of functionality for free. Browser, Office suite, PDF viewer, movie viewer... and plenty of software installable at a click.</li>\n</ul>\n<p>There's more... the internet pretty much runs on Linux servers, you can get stripped down versions which happily run on old machines and - in case you didn't know - Android (the operating system on half the phones out there) is a version of Linux. Linux <em>rocks</em>. You just won't find it pre-installed on a laptop in a shop (yet).</p>\n<p> </p>",
            "author": {
                "name": "Russell Austerberry"
            },
            "tags": [
                   "tips"
            ],
            "date_published": "2021-01-03T21:42:19+10:00",
            "date_modified": "2021-01-04T09:34:09+10:00"
        },
        {
            "id": "https://russellausterberry.github.io/russellfix/home.html",
            "url": "https://russellausterberry.github.io/russellfix/home.html",
            "title": "Home",
            "summary": "Your local tinkerHi I'm Russell - your go-to fixit fella on Coochie. Think of me for computer issues, car/boat/van electrics, and fiddly jobs around the house. Many times at home when a printer is playing up or a computer needs taming or a tap needs&hellip;",
            "content_html": "<h3>Your local tinker</h3>\n<p>Hi I'm Russell - your go-to fixit fella on Coochie. Think of me for computer issues, car/boat/van electrics, and fiddly jobs around the house.</p>\n<p>Many times at home when a printer is playing up or a computer needs taming or a tap needs repair, I hear the magic words \"Russell fix?\" - and fix it I do. I'm now offering the whole island my troubleshooting, repair and tuition skills. </p>\n<p>If you have run out of patience with Google and haven't had any luck with the grandkids, give me a call - I may be able to help. So far I've managed to ...</p>\n<ul>\n<li>speed up slow laptops</li>\n<li>set up various computer/phone/laptop combinations to the delight of owners</li>\n<li>troubleshoot NBN connection issues</li>\n<li>rewire a quad bike</li>\n<li>access and replace a dead car battery (not easy when you can't open the door!)</li>\n<li>install cheap and simple power window switches in car doors</li>\n<li>repair and paint rotted timber window frames</li>\n<li>demolish flyscreens and doors at one house - then install them in the house next door</li>\n<li>install shelving</li>\n<li>fix various mowers and whipper snippers</li>\n</ul>\n<p>I'm having fun tackling a variety of challenges, and have many happy customers.</p>\n<h3>Links:</h3>\n<p>see my article in January's <a href=\"https://coochieislandnews.com/the-newspaper/\" target=\"_blank\" rel=\"noopener noreferrer\">Coochie Island News</a>, and my listing on the back - thanks Rachael!</p>\n<h3 style=\"font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, Oxygen, Ubuntu, Cantarell, 'Fira Sans', 'Droid Sans', 'Helvetica Neue', sans-serif; font-weight: var(--font-weight-bold);\">Rates:</h3>\n<p class=\"msg msg--highlight  msg--success \" style=\"border-color: rgba(var(--success-rgb), 1); font-size: 18.3941px;\">$40 per hour.<em> It's fixed or it's free.</em></p>\n<h3 style=\"font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, Oxygen, Ubuntu, Cantarell, 'Fira Sans', 'Droid Sans', 'Helvetica Neue', sans-serif; font-weight: var(--font-weight-bold);\">Contact:</h3>\n<p style=\"font-size: 18.3941px;\">📞      0423 860 848<br>✉️      <a href=\"mailto:help@russellfix.com\" style=\"border-bottom: 3px solid rgba(var(--yellow), 1);\">help@russellfix.com</a></p>",
            "author": {
                "name": "Russell Austerberry"
            },
            "tags": [
            ],
            "date_published": "2021-01-02T16:33:54+10:00",
            "date_modified": "2021-01-04T13:05:27+10:00"
        },
        {
            "id": "https://russellausterberry.github.io/russellfix/handyman.html",
            "url": "https://russellausterberry.github.io/russellfix/handyman.html",
            "title": "Handyman",
            "summary": "I prefer the technical and repair challenges but am also available for fixit or fiddly around-the-house jobs. Assembling furniture, installing shelves, designing space saver fold-out doodahs, or small building projects. Call someone else for mowing, gardening or deck extensions ... but if you have a&hellip;",
            "content_html": "<p>I prefer the technical and repair challenges but am also available for fixit or fiddly around-the-house jobs. Assembling furniture, installing shelves, designing space saver fold-out doodahs, or small building projects.</p>\n<p>Call someone else for mowing, gardening or deck extensions ... but if you have a fiddly job that can be done in a few days or less give me a call.</p>",
            "author": {
                "name": "Russell Austerberry"
            },
            "tags": [
            ],
            "date_published": "2021-01-02T12:06:05+10:00",
            "date_modified": "2021-01-04T09:27:37+10:00"
        },
        {
            "id": "https://russellausterberry.github.io/russellfix/electrical.html",
            "url": "https://russellausterberry.github.io/russellfix/electrical.html",
            "title": "Electrical",
            "summary": "cars - vans - boatsI've spent over a year as an apprentice electrician on island, getting used to those invisible electrons and how they work. While you need a licensed electrician for any 240v work, I'm quite able to tackle most of the electrical challenges&hellip;",
            "content_html": "<h3>cars - vans - boats</h3>\n<p>I've spent over a year as an apprentice electrician on island, getting used to those invisible electrons and how they work. While you need a licensed electrician for any 240v work, I'm quite able to tackle most of the electrical challenges in bikes, boats, buggies, vans or e-bikes.</p>\n<h3>TV systems</h3>\n<p>I'm gearing up to be able to diagnose and fix faults with your TV setup, from the antenna down.</p>",
            "author": {
                "name": "Russell Austerberry"
            },
            "tags": [
            ],
            "date_published": "2021-01-02T12:00:11+10:00",
            "date_modified": "2021-01-04T09:27:23+10:00"
        },
        {
            "id": "https://russellausterberry.github.io/russellfix/computers.html",
            "url": "https://russellausterberry.github.io/russellfix/computers.html",
            "title": "Computers",
            "summary": "RepairI've been tinkering with computers for 30 years which gives me a good sense of how to troubleshoot and repair. There's a lot of issues I can address, and if it's beyond me I'll recommend professional services. What issues do you struggle with? Write a&hellip;",
            "content_html": "<h3>Repair</h3>\n<p>I've been tinkering with computers for 30 years which gives me a good sense of how to troubleshoot and repair. There's a lot of issues I can address, and if it's beyond me I'll recommend professional services.</p>\n<h3>Tuition</h3>\n<p>What issues do you struggle with? Write a list of what frustrates you, and call me. I recommend one on one tuition sessions, we can straighten out a lot of kinks in an hour. Also see the <a href=\"#non-existing-post-with-id-3\">Tips </a>section for some of my general setup recommendations.</p>\n<h3>Setup</h3>\n<p>NBN. Routers. Antivirus. Email. Syncing settings. Password managers. Phones, tablets, laptops, desktops. iOS, Windows, Linux, Android. Copy stuff. Sort out folders. Whatever... give me a call!</p>\n<h3>Websites</h3>\n<p>Call me to discuss options.</p>",
            "author": {
                "name": "Russell Austerberry"
            },
            "tags": [
            ],
            "date_published": "2021-01-02T11:49:51+10:00",
            "date_modified": "2021-01-04T09:27:55+10:00"
        }
    ]
}
